/*

У супермаркеті вишикувалась черга до кас самообслуговування. Ваша задача - написати функцію, яка обчислює загальний час, 
необхідний для того, щоб усі покупці змогли розрахуватись!
Функція має дві вхідні змінні:
customers: масив  натуральних чисел, що представляє чергу. Кожне ціле число представляє клієнта, 
а його значення - це час, необхідний для того, щоб розрахуватися.
n: натуральне число, кількість кас.
Функція повинна повернути ціле число - загальний час, необхідний для цього.

Порядок в черзі НІКОЛИ не змінюється.

Припустимо, що перша людина в черзі (тобто перший елемент масиву) проходить до каси, як тільки вона звільняється.

Наприклад
queueTime([5,3,4], 1)
// має повертати 12
// тому що при n=1 загальний час дорівнює сумі часів
queueTime([10,2,3,3], 2)
// має повернути 10
// тому що тут n=2 і 2-га, 3-тя і 4-та людина в черзі 
// черзі закінчать раніше, ніж закінчить 1-а людина.
queueTime([2,3,10], 2)
// має повернути 12

*/

function queueTime(customers, n) {
  //   const array = [];
  //   for (let i = 0; i < n; i += 1) {
  //     array.push(0);
  //   }

  const array = new Array(n).fill(0);
  //   for (let customer of customers) {
  //     const index = array.indexOf(Math.min(...array));
  //     array[index] += customer;
  //   }

  customers.forEach(customer => {
    const index = array.indexOf(Math.min(...array));
    array[index] += customer;
  });
  return Math.max(...array);
}
console.log(queueTime([10, 2, 3, 3], 2));
console.log(queueTime([5, 3, 4], 1));
console.log(queueTime([2, 3, 10], 2));
